<!DOCTYPE HTML><html>
<head>
  <title>Sz&oacute; &Oacute;ra</title>
  <style>
    html {font-family: Arial; display: inline-block; text-align: center; background-color: #17202A}
    h1 {  font-size: 4rem;  }
    p {  font-size: 1.2rem;  text-align: justify;}
    body {  margin: 2rem; color: #AED6F1; }


  </style>
</head>
<body>

<h1>Sz&oacute; &Oacute;ra</h1>

<p>A sz&oacute; &oacute;ra egy olyan szerkezet ami egy 10x10 bet&#369;b&#337;l &aacute;ll&oacute; &oacute;ralapon az egyes bet&#369;k megvil&aacute;g&iacute;t&aacute;s&aacute;val mondja el az id&#337;t. Ezen a fel&uuml;leten az id&#337;t 5 perc pontoss&aacute;ggal tudja le&iacute;rni, &quot;&ouml;t perccel m&uacute;lt x &oacute;ra&quot;, &quot;t&iacute;z perccel m&uacute;lt x &oacute;ra&quot;, &quot;negyed x&quot;, stb form&aacute;ban. Az id&#337; ki&iacute;r&aacute;sa kis anim&aacute;ci&oacute;val t&ouml;rt&eacute;nik.</p>

<img src="20210415_150918.jpg"/>

<p>Az &oacute;ra el&#337;lapja sz&aacute;lcsiszolt rozsdamentes ac&eacute;l, matt lakkal lef&uacute;jva. E m&ouml;g&ouml;tt tal&aacute;lhat&oacute; pausz pap&iacute;r a homog&eacute;n vil&aacute;g&iacute;t&aacute;s &eacute;rdek&eacute;ben &eacute;s egy szines m&aacute;trix kijelz&#337; ami a megvil&aacute;g&iacute;t&aacute;st biztos&iacute;tja. A vez&eacute;rl&eacute;st egy wifis mikrokontroller v&eacute;gzi, ami csatlakozik az otthoni wifi h&aacute;l&oacute;zatra majd a pontos &iacute;d&#337; egy id&#337; szerverr&#337;l lek&eacute;ri. &Iacute;gy az &oacute;r&aacute;t nem kell &eacute;s nem is lehet be&aacute;ll&iacute;tani.</p>

<img src="20210415_150928.jpg"/>

<p>Mivel az id&#337;t csak 5 perc pontoss&aacute;ggal mutatja hogy a kijelzett id&#337; kicsit &eacute;rdekesebb legyen, minden 5 percben egy kis anim&aacute;ci&oacute; l&aacute;that&oacute;, ahol v&eacute;letlen sz&iacute;nnel v&eacute;letlen bet&#369;k gyulladnak ki, majd 10 m&aacute;sodperc m&uacute;lva visszat&eacute;r az id&#337; kijelz&eacute;se.</p>

<img src="20210415_150956.jpg"/>

<p>Az id&#337; megjelen&iacute;t&eacute;se k&ouml;veti a napszak sz&iacute;neit, nappal feh&eacute;r sz&iacute;nnel jelennek meg a bet&#369;k, amely naplementekor folyamatosan v&ouml;r&ouml;ses sz&iacute;nbe megy &aacute;t, majd az k&eacute;k sz&iacute;nbe est&eacute;re. Reggel pedig a k&eacute;k narancsba megy &aacute;t napfelkeltekor &eacute;s onnan vissza feh&eacute;r. Az &oacute;ra oldal&aacute;n tal&aacute;lhat&oacute; f&eacute;ny&eacute;rz&eacute;kel&#337;, &iacute;gy s&ouml;t&eacute;ted&eacute;skor a kijelz&#337; f&eacute;nyereje is cs&ouml;kken. Teljes s&ouml;t&eacute;ts&eacute;gben is viszonylag vil&aacute;gos, egy h&aacute;l&oacute;szob&aacute;ban zavar&oacute; lehet.</p>

<iframe width="560" height="315" src="https://www.youtube.com/embed/GCDzeDKbH84" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe><iframe width="560" height="315" src="https://www.youtube.com/embed/kWotbvFRAgA" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

<p>Az &oacute;ra egy 25x25 centim&eacute;teres IKEA k&eacute;pkeretben kapott helyett, ami feh&eacute;r vagy fekete sz&iacute;n&#369; lehet. M&#369;k&ouml;d&eacute;sehez sz&uuml;ks&eacute;ges &aacute;ramot egy USB k&aacute;belen kapja, illetve egy USB t&ouml;lt&#337;r&#337;l. De a USB t&ouml;lt&#337; helyettes&iacute;thet&#337; b&aacute;rmilyen hagyom&aacute;nyos, 1.5A-t leadni k&eacute;pes t&ouml;lt&#337;vel.</p>

<img src="20210415_192038.jpg"/>

<p>Amennyiben valakinek fontos, jelzem el&#337;re hogy alulr&oacute;l a harmadik sorban a &quot;TIZENEGY&quot; sz&oacute;b&oacute;l az els&#337; h&aacute;rom bet&#369;t haszn&aacute;lom a t&iacute;z &oacute;ra kijelz&eacute;sekor. &Iacute;gy ez a sz&oacute; r&ouml;vid i bet&#369;vel jelenik meg.</p>

<img src="20210415_205132.jpg"/>

</body>
</html>